# Вставляти виконуваваний код в бібліотеку в цьому місці не бажано, бо він буде виконуватись при кожному імпорті
print("Це буде виведено коли ми здійнюємо імпорт даної бібліотеки або викликаємо файл на пряму!")

def my_fun_from_library():
    print("Ци вивід функції яку було імпортовано з бібліотки!")

if __name__ == "__main__":
    # Якщо наша програма також має бути бібліотекою, тоді це юлок є обоавєзковим
    # тут ми будемо писати код який виконується при прямому кивлику цього файла
    print("Це виконається тільки за умови безпосереднього запуску цього файлу і ніколи при імпорті.")